#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jawn/automating-terraform/runs/run-CqYa3u6kLBPpqsV1

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
local_file.foo[0]: Refreshing state... [id=4bf3e335199107182c6f7638efaad377acc7f452]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.foo[0] will be created
  # (moved from local_file.foo)
  + resource "local_file" "foo" {
      + content              = "foo 0 ! "
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo0.bar"
      + id                   = (known after apply)
    }

  # local_file.foo[1] will be created
  + resource "local_file" "foo" {
      + content              = "foo 1 ! "
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./foo1.bar"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @javvn, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*